_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ДеревоСметПростое.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ДеревоСметПростое</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дерево</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементКорня</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокИсключений</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_МетодыРасчетаЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_МетодыРасчетаЛС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БазисноИндексный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ресурсный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_ОбъектнаяСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_ОбъектнаяСмета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазисныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлаваССРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСметы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленаВЦенахНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛокальныеСметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛокальнаяСмета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОбъектов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимитированнаяЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазисноеЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаБазисногоЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСметнойЗарплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТрудоемкости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьВШапку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ДеревоСметПростое/Forms/ФормаУпр/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СтройкаПриИзменении(Элемент)
	ОбновитьДеревоСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоСервер()
	Дерево = РеквизитФормыВЗначение("ДЗ",Тип("ДеревоЗначений"));
	ОбновитьДерево(Дерево);
	ЗначениеВРеквизитФормы(Дерево,"ДЗ");
КонецПроцедуры

&НаСервере
Процедура ОбновитьДерево(ДеревоЗначений,АктивныйЭлемент = Неопределено,СохранитьТаблицу = Ложь)
	
	БезПомеченных		= Параметры.БезПомеченных;
	БезАктов			= Параметры.БезАктов;
	ЕстьАкты            = Параметры.ЕстьАкты;
	ЭлементКорня		= Объект.ЭлементКорня;
	ВключатьРазделы		= Параметры.ВключатьРазделы;
	ВключатьОС			= Объект.ВключатьОС;
	ВключатьСС			= Объект.ВключатьСС;
	ВключатьЛС			= Объект.ВключатьЛС;
	ТекОбъект			= Стройка;
	СписокИсключений	= Объект.СписокИсключений;
	СхемаЗапроса 		= Новый СхемаЗапроса;
	
	СхемаЗапроса.УстановитьТекстЗапроса("ВЫБРАТЬ РАЗРЕШЕННЫЕ
										|	АктВыполненныхРабот.ЛокальнаяСмета,
										|	СУММА(1) КАК КоличествоАктов
										|ПОМЕСТИТЬ ВТ_АктыСметы
										|ИЗ
										|	Документ.СМ_АктВыполненныхРабот КАК АктВыполненныхРабот
										|ГДЕ
										|	АктВыполненныхРабот.ПометкаУдаления = ЛОЖЬ 
										|СГРУППИРОВАТЬ ПО
										|	АктВыполненныхРабот.ЛокальнаяСмета
										|;
										|
										|////////////////////////////////////////////////////////////////////////////////
										|ВЫБРАТЬ
										|	ВТ_АктыСметы.ЛокальнаяСмета,
										|	ВЫБОР
										|		КОГДА ВТ_АктыСметы.КоличествоАктов > 1
										|			ТОГДА 2
										|		ИНАЧЕ 1
										|	КОНЕЦ КАК КартинкаАкт
										|ПОМЕСТИТЬ ВТ_СметыКартинкиАкты
										|ИЗ
										|	ВТ_АктыСметы КАК ВТ_АктыСметы
										|;");
	
	//	при создании схема содержит один пакет и один оператор в пакете.
	Пакет		= СхемаЗапроса.ПакетЗапросов[0];
	Оператор	= Пакет.Операторы[0];
	
	Если ЗначениеЗаполнено(Стройка) Тогда
		Оператор.Отбор.Добавить("АктВыполненныхРабот.Стройка В (&ОбъектСтроительства)");			
	КонецЕсли;
	
	//	ЗАПРОС (Документ.СМ_ЛокальнаяСмета)
	ПакетВТ_Сметы = СхемаЗапроса.ПакетЗапросов.Добавить();
	//	ПОМЕСТИТЬ (временная таблица)
	ПакетВТ_Сметы.ТаблицаДляПомещения	= "ВТ_Сметы";
	ПакетВТ_Сметы.ВыбиратьРазрешенные = Истина;
	
	Если ВключатьЛС Тогда
	
		//	по умолчанию, создается один оператор, проверяем его на "пусто"
		Если НЕ ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1].Источники.Количество() тогда
			ОператорЛокальнаяСмета	= ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1];
		Иначе
			ОператорЛокальнаяСмета	= ПакетВТ_Сметы.Операторы.Добавить();
		КонецЕсли;
		
		//	ИЗ
		СметыКартинкиАкты	= ОператорЛокальнаяСмета.Источники.Добавить(ПакетВТ_Сметы.ДоступныеТаблицы.Найти("ВТ_СметыКартинкиАкты"), "ВТ_СметыКартинкиАкты");
		СМ_ЛокальнаяСмета	= ОператорЛокальнаяСмета.Источники.Добавить(ПакетВТ_Сметы.ДоступныеТаблицы.Найти("Документ.СМ_ЛокальнаяСмета"), "ДокументЛокальнаяСмета");
		
		//	ВЫБРАТЬ (поля)
		СМ_ЛокальнаяСметаСсылка			= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ДокументЛокальнаяСмета.Ссылка", 0);
		СМ_ЛокальнаяСметаИД				= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ДокументЛокальнаяСмета.ИД", 1);
		СМ_ЛокальнаяСметаИДРодителя		= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ВЫБОР
		|	КОГДА (ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка) ИЛИ
		|		  ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)) ИЛИ 
		|         (ДокументЛокальнаяСмета.ИДРодителя Ссылка Документ.СМ_ОбъектнаяСмета И 
		|		  НЕ ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка) И НЕ &ВключатьОС) ИЛИ
		|         (ДокументЛокальнаяСмета.ИДРодителя Ссылка Документ.СМ_СводнаяСмета И 
		|		  НЕ ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка) И НЕ &ВключатьСС)
		|	ТОГДА НЕОПРЕДЕЛЕНО
		|	ИНАЧЕ ДокументЛокальнаяСмета.ИДРодителя
		|КОНЕЦ", 2);
		//СМ_ЛокальнаяСметаИДРодителя = ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ВЫБОР
		//	|	КОГДА ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка) ИЛИ
		//	|		  ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка) ИЛИ 
		//	|		  (НЕ ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка) ИЛИ
		//	|		   НЕ ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка) И НЕ &ВключатьОС)
		//	|	ТОГДА НЕОПРЕДЕЛЕНО
		//	|	ИНАЧЕ ДокументЛокальнаяСмета.ИДРодителя
		//	|КОНЕЦ", 2);
		СМ_ЛокальнаяСметаНаименование	= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ДокументЛокальнаяСмета.Наименование", 3);
		СМ_ЛокальнаяСметаНомерСметы		= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ДокументЛокальнаяСмета.НомерСметы", 4);
		СМ_ЛокальнаяСметаТип			= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("""ЛокальнаяСмета""", 5);
		СМ_ЛокальнаяСметаКартинкаАкты	= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ЕСТЬNULL(ВТ_СметыКартинкиАкты.КартинкаАкт, 0)", 6);
		СМ_ЛокальнаяСметаСортировка		= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("3", 7);
		
		//	СВЯЗИ
		//СМ_ЛокальнаяСмета.Соединения.Добавить(СметыКартинкиАкты, "ВТ_СметыКартинкиАкты.ЛокальнаяСмета = ДокументЛокальнаяСмета.Ссылка");
		СметыКартинкиАктыСоединение	= СметыКартинкиАкты.Соединения[0];
		СметыКартинкиАктыСоединение.ТипСоединения	= ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
		
		//	УСЛОВИЯ
		ОператорЛокальнаяСмета.Отбор.Добавить("НЕ ДокументЛокальнаяСмета.Ссылка В (&СписокИсключений)");
		
		Если БезПомеченных Тогда
			ОператорЛокальнаяСмета.Отбор.Добавить("ДокументЛокальнаяСмета.ПометкаУдаления = ЛОЖЬ");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стройка) Тогда
			ОператорЛокальнаяСмета.Отбор.Добавить("ДокументЛокальнаяСмета.Стройка В (&ОбъектСтроительства)");			
		КонецЕсли;

		Если ЗначениеЗаполнено(ПоискПоСтроке) Тогда
			ОператорЛокальнаяСмета.Отбор.Добавить("(ДокументЛокальнаяСмета.НомерСметы Подобно &СтрокаПоиска ИЛИ ДокументЛокальнаяСмета.Наименование Подобно &СтрокаПоиска)");			
		КонецЕсли;

		Если БезАктов Тогда
			ОператорЛокальнаяСмета.Отбор.Добавить("ЕСТЬNULL(ВТ_СметыКартинкиАкты.КартинкаАкт, 0)=0");
		ИначеЕсли ЕстьАкты Тогда
			ОператорЛокальнаяСмета.Отбор.Добавить("Не ЕСТЬNULL(ВТ_СметыКартинкиАкты.КартинкаАкт, 0)=0");
		КонецЕсли;

		Если НЕ ЭлементКорня = Неопределено Тогда
			ОператорЛокальнаяСмета.Отбор.Добавить("ДокументЛокальнаяСмета.Ссылка = &Ссылка ИЛИ ДокументЛокальнаяСмета.ИДРодителя = &Ссылка ИЛИ ДокументЛокальнаяСмета.ИДРодителя.ИДРодителя = &Ссылка");
		КонецЕсли;
	
	КонецЕсли;
	
	//	РАЗДЕЛЫ
	Если ВключатьРазделы Тогда
		
		// по умолчанию, создается один оператор, проверяем его на "пусто"
		Если НЕ ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1].Источники.Количество() тогда
			ОператорРазделЛокальнойСметы = ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1];
		Иначе
			ОператорРазделЛокальнойСметы = ПакетВТ_Сметы.Операторы.Добавить();
		КонецЕсли;
		
		//	ИЗ
		СМ_РазделЛокальнойСметы	= ОператорРазделЛокальнойСметы.Источники.Добавить(ПакетВТ_Сметы.ДоступныеТаблицы.Найти("Документ.СМ_РазделЛокальнойСметы"), "ДокументРазделЛокальнойСметы");
		
		//	ВЫБРАТЬ (поля)
		СМ_РазделЛокальнойСметыСсылка		= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("ДокументРазделЛокальнойСметы.Ссылка", 0);
		СМ_РазделЛокальнойСметыИД			= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("ДокументРазделЛокальнойСметы.ИД", 1);
		СМ_РазделЛокальнойСметыИДРодителя	= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("ДокументРазделЛокальнойСметы.ИДРодителя", 2);
		СМ_РазделЛокальнойСметыНаименование	= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("ДокументРазделЛокальнойСметы.НаименованиеДляПечати", 3);
		СМ_РазделЛокальнойСметыНомерСметы	= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("ДокументРазделЛокальнойСметы.ПорНомер", 4);
		СМ_РазделЛокальнойСметыТип			= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("""РазделЛокальнойСметы""", 5);
		СМ_РазделЛокальнойСметыКартинкаАкты	= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("0", 6);
		СМ_РазделЛокальнойСметыСортировка	= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("4", 7);

		//	УСЛОВИЯ
		ОператорРазделЛокальнойСметы.Отбор.Добавить("НЕ ДокументРазделЛокальнойСметы.Ссылка В (&СписокИсключений)");
		
		Если НЕ ЭлементКорня = Неопределено Тогда
			ОператорРазделЛокальнойСметы.Отбор.Добавить("ДокументРазделЛокальнойСметы.ИДСметы = &Ссылка ИЛИ
															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя = &Ссылка ИЛИ
															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.ИДРодителя = &Ссылка");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стройка) Тогда
			ОператорРазделЛокальнойСметы.Отбор.Добавить("ДокументРазделЛокальнойСметы.ИДСметы.Стройка В (&ОбъектСтроительства) ИЛИ
															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.Стройка В (&ОбъектСтроительства) ИЛИ
															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.ИДРодителя.Стройка В (&ОбъектСтроительства)");			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПоискПоСтроке) Тогда
			ОператорРазделЛокальнойСметы.Отбор.Добавить("((ДокументРазделЛокальнойСметы.ИДСметы.НомерСметы Подобно &СтрокаПоиска ИЛИ
															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.НомерСметы Подобно &СтрокаПоиска ИЛИ
															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.ИДРодителя.НомерСметы Подобно &СтрокаПоиска) ИЛИ
															|	(	ДокументРазделЛокальнойСметы.ИДСметы.Наименование Подобно &СтрокаПоиска ИЛИ
															|		ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.Наименование Подобно &СтрокаПоиска ИЛИ
															|		ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.ИДРодителя.Наименование Подобно &СтрокаПоиска))");			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВключатьОС Тогда
		
		//	по умолчанию, создается один оператор, проверяем его на "пусто"
		Если НЕ ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1].Источники.Количество() тогда
			ОператорОбъектнаяСмета	= ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1];
		Иначе
			ОператорОбъектнаяСмета	= ПакетВТ_Сметы.Операторы.Добавить();
		КонецЕсли;
		
		//	ИЗ
		СМ_ОбъектнаяСмета		= ОператорОбъектнаяСмета.Источники.Добавить(ПакетВТ_Сметы.ДоступныеТаблицы.Найти("Документ.СМ_ОбъектнаяСмета"), "ДокументОбъектнаяСмета");
		
		//	ВЫБРАТЬ (поля)
		СМ_ОбъектнаяСметаСсылка			= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("ДокументОбъектнаяСмета.Ссылка", 0);
		СМ_ОбъектнаяСметаИД				= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("ДокументОбъектнаяСмета.ИД", 1);
		СМ_ОбъектнаяСметаИДРодителя		= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("ВЫБОР
		|	КОГДА ДокументОбъектнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка) ИЛИ
		|		  (НЕ ДокументОбъектнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка) И НЕ &ВключатьСС)
		|	ТОГДА НЕОПРЕДЕЛЕНО
		|	ИНАЧЕ ДокументОбъектнаяСмета.ИДРодителя
		|КОНЕЦ", 2);
		СМ_ОбъектнаяСметаНаименование	= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("ДокументОбъектнаяСмета.Наименование", 3);
		СМ_ОбъектнаяСметаНомерСметы		= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("ДокументОбъектнаяСмета.НомерСметы", 4);
		СМ_ОбъектнаяСметаТип			= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("""ОбъектнаяСмета""", 5);
		СМ_ОбъектнаяСметаКартинкаАкты	= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("0", 6);
		СМ_ОбъектнаяСметаСортировка		= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("2", 7);

		//	УСЛОВИЯ
		ОператорОбъектнаяСмета.Отбор.Добавить("НЕ ДокументОбъектнаяСмета.Ссылка В (&СписокИсключений)");
		
		Если БезПомеченных Тогда
			ОператорОбъектнаяСмета.Отбор.Добавить("ДокументОбъектнаяСмета.ПометкаУдаления = ЛОЖЬ ");
		КонецЕсли;

		Если ЗначениеЗаполнено(Стройка) Тогда
			ОператорОбъектнаяСмета.Отбор.Добавить("ДокументОбъектнаяСмета.Стройка В (&ОбъектСтроительства)");			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПоискПоСтроке) Тогда
			ОператорОбъектнаяСмета.Отбор.Добавить("(ДокументОбъектнаяСмета.НомерСметы Подобно &СтрокаПоиска ИЛИ ДокументОбъектнаяСмета.Наименование Подобно &СтрокаПоиска)");			
		КонецЕсли;
		
		Если НЕ ЭлементКорня = Неопределено Тогда
			ОператорОбъектнаяСмета.Отбор.Добавить("ДокументОбъектнаяСмета.Ссылка = &Ссылка ИЛИ ДокументОбъектнаяСмета.ИДРодителя = &Ссылка");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВключатьСС Тогда
		
		// по умолчанию, создается один оператор, проверяем его на "пусто"
		Если НЕ ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1].Источники.Количество() тогда
			ОператорСводнаяСмета	= ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1];
		Иначе
			ОператорСводнаяСмета	= ПакетВТ_Сметы.Операторы.Добавить();
		КонецЕсли;
		
		// ИЗ
		СМ_СводнаяСмета			= ОператорСводнаяСмета.Источники.Добавить(ПакетВТ_Сметы.ДоступныеТаблицы.Найти("Документ.СМ_СводнаяСмета"), "ДокументСводнаяСмета");
		
		// ВЫБРАТЬ (поля)
		СМ_СводнаяСметаСсылка		= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("ДокументСводнаяСмета.Ссылка", 0);
		СМ_СводнаяСметаИД			= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("ДокументСводнаяСмета.ИД", 1);
		СМ_СводнаяСметаИДРодителя	= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("НЕОПРЕДЕЛЕНО", 2);
		СМ_СводнаяСметаНаименование	= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("ДокументСводнаяСмета.Наименование", 3);
		СМ_СводнаяСметаНомерСметы	= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("ДокументСводнаяСмета.НомерСметы", 4);
		СМ_СводнаяСметаТип			= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("""СводнаяСмета""", 5);
		СМ_СводнаяСметаКартинкаАкты	= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("0", 6);
		СМ_СводнаяСметаСортировка	= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("1", 7);
		// УСЛОВИЯ
		ОператорСводнаяСмета.Отбор.Добавить("НЕ ДокументСводнаяСмета.Ссылка В (&СписокИсключений)");
		
		Если БезПомеченных Тогда
			ОператорСводнаяСмета.Отбор.Добавить("ДокументСводнаяСмета.ПометкаУдаления = ЛОЖЬ ");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стройка) Тогда
			ОператорСводнаяСмета.Отбор.Добавить("ДокументСводнаяСмета.Стройка В (&ОбъектСтроительства)");			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПоискПоСтроке) Тогда
			ОператорСводнаяСмета.Отбор.Добавить("(ДокументСводнаяСмета.НомерСметы Подобно &СтрокаПоиска ИЛИ ДокументСводнаяСмета.Наименование Подобно &СтрокаПоиска)");			
		КонецЕсли;

		Если НЕ ЭлементКорня = Неопределено Тогда
			ОператорСводнаяСмета.Отбор.Добавить("ДокументСводнаяСмета.Ссылка = &Ссылка");
		КонецЕсли;
		
	КонецЕсли;
		
	//	ОБЪЕДИНЕНИЯ/ПСЕВДОНИМЫ	
	ПакетВТ_Сметы.Колонки[0].Псевдоним	= "Ссылка";
	ПакетВТ_Сметы.Колонки[1].Псевдоним	= "ИД";
	ПакетВТ_Сметы.Колонки[2].Псевдоним	= "ИДРодителя";
	ПакетВТ_Сметы.Колонки[3].Псевдоним	= "Наименование";
	ПакетВТ_Сметы.Колонки[4].Псевдоним	= "НомерСметы";
	ПакетВТ_Сметы.Колонки[5].Псевдоним	= "Тип";
	ПакетВТ_Сметы.Колонки[6].Псевдоним	= "КартинкаАкты";
	ПакетВТ_Сметы.Колонки[7].Псевдоним	= "Сортировка";
	
	//	ВЫБРАТЬ
	ПакетСметы		= СхемаЗапроса.ПакетЗапросов.Добавить();
	ПакетСметы.ВыбиратьРазрешенные = Истина;
	ОператорСметы	= ПакетСметы.Операторы[0];
	
	//	ИЗ
	Сметы			= ОператорСметы.Источники.Добавить(ПакетСметы.ДоступныеТаблицы.Найти("ВТ_Сметы"), "Сметы");
		
	//	ВЫБРАТЬ (поля)
	СметыСсылка			 = ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.Ссылка");
	СметыИД				 = ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.ИД");
	СметыИДРодителя		 = ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.ИДРодителя");
	СметыНаименование	 = ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.Наименование");
	СметыНомерСметы		 = ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.НомерСметы");
	СметыТип			 = ОператорСметы.ВыбираемыеПоля.Добавить("Тип");
	СметыКартинкаАкты	 = ОператорСметы.ВыбираемыеПоля.Добавить("КартинкаАкты");
	СметыПометкаУдаления = ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.Ссылка.ПометкаУдаления");
	СметыПроведен	     = ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.Ссылка.Проведен");
	СметыМетодРасчета	 = ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.Ссылка.МетодРасчета");
	
	ПараметрыЗапроса	= СхемаЗапроса.НайтиПараметры();
	ТекстЗапроса		= СхемаЗапроса.ПолучитьТекстЗапроса();
	ТекстЗапроса		= ТекстЗапроса + " УПОРЯДОЧИТЬ ПО Сортировка";
	Запрос				= Новый Запрос(ТекстЗапроса);
	
	Если НЕ ПараметрыЗапроса.Найти("Ссылка") = Неопределено Тогда
		Запрос.УстановитьПараметр("Ссылка"				, ЭлементКорня);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("СтрокаПоиска") = Неопределено Тогда
		Запрос.УстановитьПараметр("СтрокаПоиска"		, ПоискПоСтроке+"%");		   
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("ОбъектСтроительства") = Неопределено Тогда
		Запрос.УстановитьПараметр("ОбъектСтроительства"	, ТекОбъект);		   
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("СписокИсключений") = Неопределено Тогда
		Запрос.УстановитьПараметр("СписокИсключений"	, СписокИсключений);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("ВключатьЛС") = Неопределено Тогда
		Запрос.УстановитьПараметр("ВключатьЛС"			, ВключатьЛС);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("ВключатьОС") = Неопределено Тогда
		Запрос.УстановитьПараметр("ВключатьОС"			, ВключатьОС);
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса.Найти("ВключатьСС") = Неопределено Тогда
		Запрос.УстановитьПараметр("ВключатьСС"			, ВключатьСС);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ПостроитьДеревоПоТаблицеПростое(ДеревоЗначений, РезультатЗапроса, АктивныйЭлемент);
	Если СохранитьТаблицу Тогда
		АдресТаблицы = ПоместитьВоВременноеХранилище(РезультатЗапроса,ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ПостроитьДеревоПоТаблицеПростое(ДеревоЗначений,ТаблицаКорень,АктивныйЭлемент)
	
	ДеревоЗначений.Строки.Очистить();

	Отбор = Новый Структура();
	Отбор.Вставить("ИДРодителя", Неопределено);
	Корень = ТаблицаКорень.НайтиСтроки(Отбор);
	Для Каждого СтрокаКорня Из Корень Цикл
		СтрокаДерева = ДеревоЗначений.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаКорня);
		СтрокаДерева.Картинка = ПолучитьКартинкуСтроки(СтрокаКорня.Ссылка,СтрокаКорня);
		Если (ЗначениеЗаполнено(АктивныйЭлемент) И АктивныйЭлемент = СтрокаКорня.Ссылка) или 
			((Не ЗначениеЗаполнено(АктивныйЭлемент)) И (Объект.ВключатьЛС и Объект.ВключатьСС и Объект.ВключатьОС)) Тогда
			ПостроитьВетку(СтрокаДерева, СтрокаКорня.Ссылка, ТаблицаКорень);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьВетку(Ветка, ИдРодителя, ТаблицаКорень)

	Отбор = Новый Структура;
	Отбор.Вставить("ИДРодителя",ИдРодителя);
	
	Корень = ТаблицаКорень.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаКорня Из Корень Цикл
		СтрокаДерева = Ветка.Строки.Добавить();	
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаКорня);
		СтрокаДерева.Картинка = ПолучитьКартинкуСтроки(СтрокаКорня.Ссылка,СтрокаКорня);
		ПостроитьВетку(СтрокаДерева, СтрокаКорня.Ссылка, ТаблицаКорень);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Параметры.МножественныйВыбор Тогда
		ОповеститьОВыборе(Элементы.ДЗ.ТекущиеДанные.Ссылка);
	Иначе
		Закрыть(Элементы.ДЗ.ТекущиеДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьКартинкуСтроки(ТекЭлемент,СтрокаКорня)
	
	// 0. Лим затрата
	// 1. СС
	// 2. ОС
	// 3. ЛС (ресурсный метод)
	// 4. ЛС (базисно инд метод)
	// 5. ЛС просто	
	
	//  с пометкой удаления
	// 6. Лим затрата
	// 7. СС
	// 8. ОС
	// 9. ЛС (ресурсный метод)
	// 10. ЛС (базисно инд метод)
	// 11. ЛС просто	
		
	Если ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		Если СтрокаКорня.СсылкаМетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
			ТекКартинка = ?(СтрокаКорня.СсылкаПометкаУдаления,9,?(СтрокаКорня.СсылкаПроведен,15,3));
			Возврат ТекКартинка;	
		ИначеЕсли СтрокаКорня.СсылкаМетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
			ТекКартинка = ?(СтрокаКорня.СсылкаПометкаУдаления,10,?(СтрокаКорня.СсылкаПроведен,16,4));
			Возврат ТекКартинка;
		Иначе
			ТекКартинка = ?(СтрокаКорня.СсылкаПометкаУдаления,11,?(СтрокаКорня.СсылкаПроведен,17,5));
			Возврат ТекКартинка;
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		ТекКартинка = ?(СтрокаКорня.СсылкаПометкаУдаления,8,?(СтрокаКорня.СсылкаПроведен,14,2));
		Возврат ТекКартинка;
	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		ТекКартинка = ?(СтрокаКорня.СсылкаПометкаУдаления,7,?(СтрокаКорня.СсылкаПроведен,13,1));
		Возврат ТекКартинка;
	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
		ТекКартинка = ?(СтрокаКорня.СсылкаПометкаУдаления,28,27);
		Возврат ТекКартинка;
	Иначе
		Возврат	5;
	КонецЕсли;	
		
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗначениеЗаполнения") Тогда
		Если Параметры.ЗначениеЗаполнения.Свойство("ЭлементКорня") Тогда
			Объект.ЭлементКорня = Параметры.ЗначениеЗаполнения.ЭлементКорня;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ИсключитьРаздел") Тогда
		Объект.СписокИсключений.Добавить(Параметры.ИсключитьРаздел);
	КонецЕсли;
	
	Параметры.ВключатьЛС = Истина;
	Если НЕ Параметры.ВключатьЛС
		И НЕ Параметры.ВключатьОС
		И НЕ Параметры.ВключатьСС тогда
		Объект.ВключатьЛС = Истина;
	Иначе
		Объект.ВключатьЛС = Параметры.ВключатьЛС;
	КонецЕсли;
	Объект.ВключатьОС = Параметры.ВключатьОС;
	Объект.ВключатьСС = Параметры.ВключатьСС;
	Если Не Объект.ВключатьОС И Объект.ВключатьСС Тогда
		Объект.ВключатьОС = Истина;	
	КонецЕсли;
	
	Если Параметры.ОтборСтройка Тогда
		Элементы.ГруппаОтбора.Видимость = Истина;
		Если Параметры.Свойство("Стройка") Тогда
			ЭтаФорма.Стройка = Параметры.Стройка;
		КонецЕсли;
	Иначе
		Элементы.ГруппаОтбора.Видимость = Ложь;
	КонецЕсли;
	                             	
	Дерево = РеквизитФормыВЗначение("ДЗ",Тип("ДеревоЗначений"));
	ОбновитьДерево(Дерево,Параметры.АктивныйЭлемент,Истина);
	ЗначениеВРеквизитФормы(Дерево,"ДЗ");
	
	// активировать обрабатываемую смету (ЛокальнаяСмета)
	Если ЗначениеЗаполнено(Параметры.АктивныйЭлемент) Тогда
		ТекСтрока = Дерево.Строки.Найти(Параметры.АктивныйЭлемент, "Ссылка", Истина);
		Если НЕ ТекСтрока = Неопределено Тогда
			Инд							= Дерево.Строки.Индекс(ТекСтрока);
			Элементы.ДЗ.ТекущаяСтрока 	= ДЗ.получитьЭлементы()[Инд].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;

	Если Параметры.МножественныйВыбор Тогда
		ЭтаФорма.ЗакрыватьПриВыборе = Ложь;
	КонецЕсли;
	
КонецПроцедуры //Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Элементы.ДЗ.ТекущаяСтрока = Неопределено тогда
		Элементы.ДЗ.Развернуть(Элементы.ДЗ.ТекущаяСтрока, Истина);
	КонецЕсли;
	//ПодключитьОбработчикОжидания("ИзмениласьСтрока",1); 
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоСтрокеПриИзменении(Элемент)
	ОбновитьДеревоСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДЗПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДЗ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекДок = ТекущиеДанные.Ссылка;
	
	Если ТекЭлемент <> ТекДок Тогда
		ПредЭлемент = ТекЭлемент;
		ТекЭлемент = ТекДок;
	КонецЕсли;
	ПодключитьОбработчикОжидания("ИзмениласьСтрока",0.1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзмениласьСтрока()
	
	Если Не ТекущийЭлемент.Имя = "ДЗ" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекЭлемент = ПредЭлемент Тогда
		Разворачиваем = ЗаполнитьАктивнуюСтроку(ТекЭлемент);
		
		Если Разворачиваем Тогда
			Элементы.ДЗ.Развернуть(ТекСтр, Истина);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗаполнитьАктивнуюСтроку(АктивныйЭлемент)
	
	Дерево = РеквизитФормыВЗначение("ДЗ",Тип("ДеревоЗначений"));
	ТаблицаКорень = ПолучитьИзВременногоХранилища(АдресТаблицы);
	
	СтрокаДерева = Дерево.Строки.Найти(АктивныйЭлемент,"Ссылка",Истина);
	
	Если СтрокаДерева = Неопределено ИЛИ СтрокаДерева.Строки.Количество()>0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПостроитьВетку(СтрокаДерева, АктивныйЭлемент, ТаблицаКорень);
	
	Если СтрокаДерева.Строки.Количество()=0 Тогда
		Возврат Ложь;
	КонецЕсли;

	ЗначениеВРеквизитФормы(Дерево,"ДЗ");
	
	Если ЗначениеЗаполнено(АктивныйЭлемент) Тогда
		ТекСтрока	= Дерево.Строки.Найти(АктивныйЭлемент, "Ссылка", Истина);
		Если НЕ ТекСтрока = НЕОПРЕДЕЛЕНО тогда
			Инд			= Дерево.Строки.Индекс(ТекСтрока);
			Элементы.ДЗ.ТекущаяСтрока = ДЗ.получитьЭлементы()[Инд].ПолучитьИдентификатор();
			ТекСтр = Элементы.ДЗ.ТекущаяСтрока;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область НаУдаление

// ***************************************************************************
//&НаСервере
//Функция Удалить_ПолучитьСписокСтроек(ТекОбъект)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	СМ_ОбъектыСтроительства.Ссылка
//	               |ИЗ
//	               |	Справочник.СМ_ОбъектыСтроительства КАК СМ_ОбъектыСтроительства
//	               |ГДЕ
//	               |	СМ_ОбъектыСтроительства.Ссылка В ИЕРАРХИИ(&Ссылка)";
//	Запрос.УстановитьПараметр("Ссылка",ТекОбъект);			   
//	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
//	
//КонецФункции


// ***************************************************************************
//&НаСервере
//Процедура Удалить_ПостроитьДеревоПоТаблице(ДеревоЗначений,ТаблицаКорень)
//	
//	Отбор = Новый Структура();
//	Отбор.Вставить("ИДРодителя", Неопределено);
//	Корень = ТаблицаКорень.НайтиСтроки(Отбор);
//	
//	Для Каждого СтрокаКорня Из Корень Цикл
//		СтрокаДерева = ДеревоЗначений.Строки.Добавить();
//		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаКорня);
//		СтрокаДерева.Картинка = ПолучитьКартинкуСтроки(СтрокаКорня.Ссылка,СтрокаКорня);
//		ПостроитьВетку(СтрокаДерева, СтрокаКорня.Ссылка, ТаблицаКорень);
//	КонецЦикла;
//	
//КонецПроцедуры

#КонецОбласти
